export interface InvoicePayment {
    /**
     *
     * شماره سوییچ پرداخت
     * __ x
     */
    iinn: number;
    /**
     *
     * شماره پذیرنده فروشگاهی
     * __ x
     */
    acn: number;
    /**
     *
     * شماره پایانه
     * __ x
     */
    trmn: number;
    /**
     *
     * روش پرداخت
     * __ x
     */
    pmt: 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8;
    /**
     *
     * شماره پیگیری
     * __ x
     */
    trn: number;
    /**
     *
     * شماره كارت پرداخت كننده صورتحساب
     * __ x
     */
    pcn: number;
    /**
     *
     * شماره/شناسه ملی/كد فراگیر اتباع غیر ایرانی پرداخت كننده صورتحساب
     * __ x
     */
    pid: number;
    /**
     *
     * تاریخ و زمان پرداخت صورتحساب
     * __ ۱۴
     */
    pdt: number;
    /**
     *
     * مبلغ پرداختی
     * __ x
     */
    pv: number;
    /**
     *
     * تفاوت نرخ خرید و فروش ارز/کارمزد فروش ارز
     * __ x
     */
    pspd: number;
}
//# sourceMappingURL=payment.d.ts.map